In [97]:
# Pandas
# Numpy

# library - collection of function
# pandas - library for manipulation of data

# programming is all about Data Type and Data Structure
# List - to iterate or manipulate homogenous data
# Tuple - to store data

# Pandas Data Strcture - Series - 1 dimensional - homogenous
# Pandas Data Strcture - DataFram - 2 dimensional

In [99]:
import pandas as pd

In [101]:
alist = [10,20,30,40,50]

In [103]:
for i in alist:
    # list heterogenous by nature
    # list is a slow daily car from A to B
    # list store things randomly
    
    # series is a fast racecare from A to B, vectorized list
    # series store things in the same place
    # series with index, ie.e primary key
    # series has 2 major attributes index and values
    # should not use for loop in pandas, for loop is slow
    
    type(i)

In [105]:
alist + 5

TypeError: can only concatenate list (not "int") to list

In [107]:
alist + alist

[10, 20, 30, 40, 50, 10, 20, 30, 40, 50]

In [109]:
s = pd.Series(alist)
s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [111]:
s + s

0     20
1     40
2     60
3     80
4    100
dtype: int64

In [113]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [115]:
s.values

array([10, 20, 30, 40, 50])

In [117]:
df = pd.DataFrame()
df["Stock"] = ["MSFT", "AAPL", "IBM", "ORCL"]
df["Price"] = [260.99, 220.75, 115.99, 56.99]
df

  Stock   Price
0  MSFT  260.99
1  AAPL  220.75
2   IBM  115.99
3  ORCL   56.99

In [119]:
# fast, gather data source, and manipulate, 
# 3 attributes, index, columns, values (doesn't need invole)
# N methods (need invoke)
# attributes vs methods

In [121]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [123]:
df.columns

Index(['Stock', 'Price'], dtype='object')

In [125]:
df.values

array([['MSFT', 260.99],
       ['AAPL', 220.75],
       ['IBM', 115.99],
       ['ORCL', 56.99]], dtype=object)

In [127]:
# create empty column

df["Shares"] = 0
df

  Stock   Price  Shares
0  MSFT  260.99       0
1  AAPL  220.75       0
2   IBM  115.99       0
3  ORCL   56.99       0

In [129]:
# 

df["Shares"] = [100, 200, 300, 400]
df

  Stock   Price  Shares
0  MSFT  260.99     100
1  AAPL  220.75     200
2   IBM  115.99     300
3  ORCL   56.99     400

In [131]:
# 1 dismoen df is series

df["Amnt"] = df["Price"] * df["Shares"]
df

  Stock   Price  Shares     Amnt
0  MSFT  260.99     100  26099.0
1  AAPL  220.75     200  44150.0
2   IBM  115.99     300  34797.0
3  ORCL   56.99     400  22796.0

In [133]:
# reassign index

df.index = df["Stock"]
df

      Stock   Price  Shares     Amnt
Stock
MSFT   MSFT  260.99     100  26099.0
AAPL   AAPL  220.75     200  44150.0
IBM     IBM  115.99     300  34797.0
ORCL   ORCL   56.99     400  22796.0

In [135]:
# common function
# axis()
# inpalce()

# row: axis = 0 or "index"
# col: axis = 1 or "columns"

# help(df.drop)

In [137]:
df.drop("Stock", axis=1, inplace=False)
df

      Stock   Price  Shares     Amnt
Stock
MSFT   MSFT  260.99     100  26099.0
AAPL   AAPL  220.75     200  44150.0
IBM     IBM  115.99     300  34797.0
ORCL   ORCL   56.99     400  22796.0

In [139]:
df.drop("Stock", axis=1, inplace=True)
df

        Price  Shares     Amnt
Stock
MSFT   260.99     100  26099.0
AAPL   220.75     200  44150.0
IBM    115.99     300  34797.0
ORCL    56.99     400  22796.0

In [141]:
# location by label
# splicing [start:stop, start:stop]
# stop is inclusive

df.loc["AAPL":"IBM", "Shares":"Amnt"]

       Shares     Amnt
Stock
AAPL      200  44150.0
IBM       300  34797.0

In [143]:
# splicing, location by index
# [start:stop, start:stop]
# 

df.iloc[1:3, 1:3]

       Shares     Amnt
Stock
AAPL      200  44150.0
IBM       300  34797.0

In [145]:
df[["Price", "Amnt"]].loc["AAPL":"IBM"]

        Price     Amnt
Stock
AAPL   220.75  44150.0
IBM    115.99  34797.0

In [147]:
df.loc["AAPL":"IBM"][["Price", "Amnt"]]

        Price     Amnt
Stock
AAPL   220.75  44150.0
IBM    115.99  34797.0

In [161]:
df.reset_index(inplace=True)
df

  Stock   Price  Shares     Amnt
0  MSFT  260.99     100  26099.0
1  AAPL  220.75     200  44150.0
2   IBM  115.99     300  34797.0
3  ORCL   56.99     400  22796.0

In [173]:
condition_aapl = df["Stock"] == "AAPL"
df[condition_aapl]["Price"].squeeze()

220.75

In [177]:
df[condition_aapl]["Price"].iloc[0]

220.75

In [181]:
df[df["Price"] < 100][["Stock", "Price"]]

  Stock  Price
3  ORCL  56.99

In [189]:
max_amnt = df["Amnt"].max()
condition_max_amnt = df["Amnt"] == max_amnt
df[condition_max_amnt]

  Stock   Price  Shares     Amnt
1  AAPL  220.75     200  44150.0